src/Reports/СводПоГруппамНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>СводПоГруппамНачислений</Name>
			<Comment>Свод по группам начислений</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/CalculationRegisters/ДополнительныеНачисленияРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>ДополнительныеНачисленияРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<Periodicity>Day</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисленияОрганизаций</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченоДнейЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкидкаПриНалогообложении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчетаСреднегоЗаработкаНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчетаСреднегоЗаработкаОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСобытия</Name>
					<Comment>Дата начала события, оплачиваемого по среднему заработку</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авторасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Comment>Документ, который зарегистрировал сторнируемое начисление</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Сторнирование</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЕдиновременныхПособийЗаСчетФСС</v8:Type>
						<v8:Type>cfg:DocumentRef.НевыходыВОрганизациях</v8:Type>
						<v8:Type>cfg:DocumentRef.ТабельУчетаРабочегоВремениОрганизации</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияПростоевРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендовОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеОтпускаРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоБольничномуЛисту</v8:Type>
						<v8:Type>cfg:DocumentRef.ПремииРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплатыРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияРазовыхНачисленийРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.РасчетПриУвольненииРаботникаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойРасчетСреднегоЗаработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерСреднегоЗаработка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

src/Catalogs/ГруппыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ГруппыНачислений</Name>
			<Comment>Группы начислений</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ВидыОплат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисленияОрганизаций</v8:Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/КатегорииПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>КатегорииПерсонала</Name>
			<Comment>Категории персонала</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Категории</Name>
					<Comment>Категории</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Reports/СводПоГруппамНачислений/Ext/ObjectModule.bsl
Перем мМакет, ПараметрыНормыЧасов,
ЗП1, СЗ1, ЗП2, СЗ2, ЗП3, СЗ3, ЗП4, СЗ4, ЗП5, СЗ5, ЗП6, СЗ6, ЗП7, СЗ7;

#Если Клиент Тогда

	
Процедура ВывестиСтрокиПодразделения(ВыборкаСтрокШтРасписания, ДокументРезультат)

	Пока ВыборкаСтрокШтРасписания.Следующий() Цикл 
		
		ВыборкаПодразделенийСледующегоУровня = ВыборкаСтрокШтРасписания.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		
		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокШтРасписания.ВидРасчета) = 1 Тогда
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаСтрокШтРасписания);
			Попытка
				ОбластьДетальныхЗаписей.Параметры.Наименование = ВыборкаСтрокШтРасписания.Ссылка.Код+ВыборкаСтрокШтРасписания.Ссылка.Наименование;
			Исключение
				
			КонецПопытки;
			
		Иначе
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаСтрокШтРасписания);
			ОбластьДетальныхЗаписей.Параметры.ВидРасчета = ВыборкаСтрокШтРасписания.ВидРасчета.Код+ВыборкаСтрокШтРасписания.ВидРасчета.Наименование;
		КонецЕсли;
		
		Если ВыборкаСтрокШтРасписания.Ссылка = NULL Тогда
			ОбластьДетальныхЗаписей.Параметры.Наименование = "ИТОГО:";
			ЗП1 = ВыборкаСтрокШтРасписания.РабочиеППП;
			ЗП2 = ВыборкаСтрокШтРасписания.ИТРППП;
			ЗП3 = ВыборкаСтрокШтРасписания.ППП;
			ЗП4 = ВыборкаСтрокШтРасписания.ИТРНГ;
			ЗП5 = ВыборкаСтрокШтРасписания.ВИТРНГ;
			ЗП6 = ВыборкаСтрокШтРасписания.Всего;
			ЗП7 = ВыборкаСтрокШтРасписания.ВИТР;
		КонецЕсли;
		ОбластьДетальныхЗаписей.Параметры.ЗП1 = ?(ЗП1=0, 0, ВыборкаСтрокШтРасписания.РабочиеППП/ЗП1*100);
		ОбластьДетальныхЗаписей.Параметры.ЗП2 = ?(ЗП2=0, 0, ВыборкаСтрокШтРасписания.ИТРППП/ЗП2*100);
		ОбластьДетальныхЗаписей.Параметры.ЗП3 = ?(ЗП3=0, 0, ВыборкаСтрокШтРасписания.ППП/ЗП3*100);
		ОбластьДетальныхЗаписей.Параметры.ЗП4 = ?(ЗП4=0, 0, ВыборкаСтрокШтРасписания.ИТРНГ/ЗП4*100);
		ОбластьДетальныхЗаписей.Параметры.ЗП5 = ?(ЗП5=0, 0, ВыборкаСтрокШтРасписания.ВИТРНГ/ЗП5*100);
		ОбластьДетальныхЗаписей.Параметры.ЗП6 = ?(ЗП6=0, 0, ВыборкаСтрокШтРасписания.Всего/ЗП6*100);
		ОбластьДетальныхЗаписей.Параметры.ЗП7 = ?(ЗП7=0, 0, ВыборкаСтрокШтРасписания.ВИТР/ЗП7*100);
		
		ОбластьДетальныхЗаписей.Параметры.СЗ1 = ?(СЗ1=0, 0, ВыборкаСтрокШтРасписания.РабочиеППП/СЗ1*100);
		ОбластьДетальныхЗаписей.Параметры.СЗ2 = ?(СЗ2=0, 0, ВыборкаСтрокШтРасписания.ИТРППП/СЗ2*100);
		ОбластьДетальныхЗаписей.Параметры.СЗ3 = ?(СЗ3=0, 0, ВыборкаСтрокШтРасписания.ППП/СЗ3*100);
		ОбластьДетальныхЗаписей.Параметры.СЗ4 = ?(СЗ4=0, 0, ВыборкаСтрокШтРасписания.ИТРНГ/СЗ4*100);
		ОбластьДетальныхЗаписей.Параметры.СЗ5 = ?(СЗ5=0, 0, ВыборкаСтрокШтРасписания.ВИТРНГ/СЗ5*100);
		ОбластьДетальныхЗаписей.Параметры.СЗ6 = ?(СЗ6=0, 0, ВыборкаСтрокШтРасписания.Всего/СЗ6*100);
		ОбластьДетальныхЗаписей.Параметры.СЗ7 = ?(СЗ7=0, 0, ВыборкаСтрокШтРасписания.ВИТР/СЗ7*100);
		
		ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
		
		ВывестиСтрокиПодразделения(ВыборкаПодразделенийСледующегоУровня, ДокументРезультат)
		
	КонецЦикла;//цикл по подразделениям текущего уровня 
	
КонецПроцедуры
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт
	
//для сделки
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ГруппыНачислений.Код + ГруппыНачислений.Наименование КАК Наименование,
		|	СУММА(Начисления.Результат) КАК Всего,
		|	Начисления.ВидРасчета КАК ВидРасчета,
		|	ГруппыНачислений.Ссылка КАК Ссылка,
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.Категория В (&РабочиеППП)
		|				ТОГДА Начисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК РабочиеППП,
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.Категория В (&ИТРППП)
		|				ТОГДА Начисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ИТРППП,
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.Категория В (&ППП)
		|				ТОГДА Начисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ППП,
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.Категория В (&ИТРНГ)
		|				ТОГДА Начисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ИТРНГ,
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.Категория В (&ВИТРНГ)
		|				ТОГДА Начисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВИТРНГ,
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.Категория В (&ВИТР)
		|				ТОГДА Начисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВИТР
		|ИЗ
		|	Справочник.ГруппыНачислений КАК ГруппыНачислений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыНачислений.ВидыОплат КАК ГруппыНачисленийВидыОплат
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ДополнительныеНачисленияРаботниковОрганизаций.Результат КАК Результат,
		|				ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета,
		|				ДополнительныеНачисленияРаботниковОрганизаций.Категория КАК Категория
		|			ИЗ
		|				РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
		|			ГДЕ
		|				ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &НачДата И &КонДата
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ОсновныеНачисленияРаботниковОрганизаций.Результат,
		|				ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
		|				ОсновныеНачисленияРаботниковОрганизаций.Категория
		|			ИЗ
		|				РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|			ГДЕ
		|				ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &НачДата И &КонДата) КАК Начисления
		|			ПО ГруппыНачисленийВидыОплат.ВидРасчета = Начисления.ВидРасчета
		|				И (ГруппыНачисленийВидыОплат.Ссылка.Код = ""1.1"")
		|		ПО (ГруппыНачисленийВидыОплат.Ссылка = ГруппыНачислений.Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.ВидРасчета,
		|	ГруппыНачислений.Код + ГруппыНачислений.Наименование,
		|	ГруппыНачислений.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование
		|ИТОГИ ПО
		|	ОБЩИЕ";
 
	Запрос.УстановитьПараметр("НачДата",	ДатаАктуальности);
	Запрос.УстановитьПараметр("КонДата",	КонДата);
	Запрос.УстановитьПараметр("РабочиеППП",	Справочники.КатегорииПерсонала.РабочиеППП.Категории.ВыгрузитьКолонку("Категория"));
	Запрос.УстановитьПараметр("ИТРППП",	Справочники.КатегорииПерсонала.ИТРППП.Категории.ВыгрузитьКолонку("Категория"));
	Запрос.УстановитьПараметр("ППП",	Справочники.КатегорииПерсонала.ППП.Категории.ВыгрузитьКолонку("Категория"));
	Запрос.УстановитьПараметр("ИТРНГ",	Справочники.КатегорииПерсонала.ИТРНГ.Категории.ВыгрузитьКолонку("Категория"));
	Запрос.УстановитьПараметр("ВИТРНГ",	Справочники.КатегорииПерсонала.ВИТРНГ.Категории.ВыгрузитьКолонку("Категория"));
	Запрос.УстановитьПараметр("ВИТР",	Справочники.КатегорииПерсонала.ВИТР.Категории.ВыгрузитьКолонку("Категория"));
	
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока РезультатЗапроса.Следующий() Цикл
		СЗ1 = РезультатЗапроса.РабочиеППП;
		СЗ2 = РезультатЗапроса.ИТРППП;
		СЗ3 = РезультатЗапроса.ППП;
		СЗ4 = РезультатЗапроса.ИТРНГ;
		СЗ5 = РезультатЗапроса.ВИТРНГ;
		СЗ6 = РезультатЗапроса.Всего;
		СЗ7 = РезультатЗапроса.ВИТР;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ГруппыНачислений.Код + ГруппыНачислений.Наименование КАК Наименование,
		|	СУММА(Начисления.Результат) КАК Всего,
		|	Начисления.ВидРасчета КАК ВидРасчета,
		|	ГруппыНачислений.Ссылка КАК Ссылка,
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.Категория В (&РабочиеППП)
		|				ТОГДА Начисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК РабочиеППП,
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.Категория В (&ИТРППП)
		|				ТОГДА Начисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ИТРППП,
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.Категория В (&ППП)
		|				ТОГДА Начисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ППП,
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.Категория В (&ИТРНГ)
		|				ТОГДА Начисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ИТРНГ,
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.Категория В (&ВИТРНГ)
		|				ТОГДА Начисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВИТРНГ,
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.Категория В (&ВИТР)
		|				ТОГДА Начисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВИТР
		|ИЗ
		|	Справочник.ГруппыНачислений КАК ГруппыНачислений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыНачислений.ВидыОплат КАК ГруппыНачисленийВидыОплат
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ДополнительныеНачисленияРаботниковОрганизаций.Результат КАК Результат,
		|				ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета,
		|				ДополнительныеНачисленияРаботниковОрганизаций.Категория КАК Категория
		|			ИЗ
		|				РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
		|			ГДЕ
		|				ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &НачДата И &КонДата
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ОсновныеНачисленияРаботниковОрганизаций.Результат,
		|				ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
		|				ОсновныеНачисленияРаботниковОрганизаций.Категория
		|			ИЗ
		|				РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|			ГДЕ
		|				ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &НачДата И &КонДата) КАК Начисления
		|			ПО ГруппыНачисленийВидыОплат.ВидРасчета = Начисления.ВидРасчета
		|		ПО (ГруппыНачисленийВидыОплат.Ссылка = ГруппыНачислений.Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.ВидРасчета,
		|	ГруппыНачислений.Код + ГруппыНачислений.Наименование,
		|	ГруппыНачислений.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование
		|ИТОГИ
		|	СУММА(Всего),
		|	СУММА(РабочиеППП),
		|	СУММА(ИТРППП),
		|	СУММА(ППП),
		|	СУММА(ИТРНГ),
		|	СУММА(ВИТРНГ),
		|	СУММА(ВИТР)
		|ПО
		|	ОБЩИЕ,
		|	Ссылка ИЕРАРХИЯ";
 
	Запрос.УстановитьПараметр("НачДата",	ДатаАктуальности);
	Запрос.УстановитьПараметр("КонДата",	КонДата);
	Запрос.УстановитьПараметр("РабочиеППП",	Справочники.КатегорииПерсонала.РабочиеППП.Категории.ВыгрузитьКолонку("Категория"));
	Запрос.УстановитьПараметр("ИТРППП",	Справочники.КатегорииПерсонала.ИТРППП.Категории.ВыгрузитьКолонку("Категория"));
	Запрос.УстановитьПараметр("ППП",	Справочники.КатегорииПерсонала.ППП.Категории.ВыгрузитьКолонку("Категория"));
	Запрос.УстановитьПараметр("ИТРНГ",	Справочники.КатегорииПерсонала.ИТРНГ.Категории.ВыгрузитьКолонку("Категория"));
	Запрос.УстановитьПараметр("ВИТРНГ",	Справочники.КатегорииПерсонала.ВИТРНГ.Категории.ВыгрузитьКолонку("Категория"));
	Запрос.УстановитьПараметр("ВИТР",	Справочники.КатегорииПерсонала.ВИТР.Категории.ВыгрузитьКолонку("Категория"));
	
	
	РезультатЗапроса = Запрос.Выполнить();
	ДокументРезультат.Очистить();
	

	////Параметры документа
	//ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	//ДокументРезультат.ПолеСлева			 = 0;
	//ДокументРезультат.ПолеСправа		 = 0;
	
	
	Область = мМакет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Шапка = "Анализ заработной платы "+Символы.ПС+"за "+Формат(ДатаАктуальности, "ДФ='dd.MM.yyyy'")+" по "+Формат(КонДата, "ДФ='dd.MM.yyyy'");
	ДокументРезультат.Вывести(Область);
	Область = мМакет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	
	ВыборкаИтог = РезультатЗапроса.Выбрать();
	
	ВывестиСтрокиПодразделения(ВыборкаИтог, ДокументРезультат);
	
КонецПроцедуры

мМакет = ПолучитьМакет("МакетРабочие");

ЗП1 = 0;
СЗ1 = 0;
ЗП2 = 0;
СЗ2 = 0;
ЗП3 = 0;
СЗ3 = 0;
ЗП4 = 0;
СЗ4 = 0;
ЗП5 = 0;
СЗ5 = 0;
ЗП6 = 0;
СЗ6 = 0;
ЗП7 = 0;
СЗ7 = 0;

#КонецЕсли
